// КОСПЕКТ

если цикл встретил break то цикл выключается

если цикл встретил continue то пропускается итерация

есть метки у циклов (можно использовать как окончание циклов)
// : metka: for(){
    
// }


//-------------------------------------------------------------

for(let i = 0;i < 0; i++){
    console.log(i);
    i++
}

//-------------------------------------------------------------

let i = 0;
while(i < 0){
    console.log(i);
    i++
}

// -------------------------------------------------------------

let i = 0;
do{
    console.log(i);
    i++
}while(i < 0)

//-------------------------------------------------------------



//-------------------------------------------------------------



//-------------------------------------------------------------



//-------------------------------------------------------------